package Seminar_1.HW;
import java.util.Scanner;
// Реализовать простой калькулятор
public class Task_3 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.printf("Ввидите первое значение:");
        int num_1 = scanner.nextInt();
        System.out.printf("Ввидите второе значение:");
        int num_2 = scanner.nextInt();


    }
}
